[
 { "term": "POO", "definition": "Programmation Orientée Objet. Paradigme qui organise le code en classes et objets avec encapsulation, héritage et polymorphisme pour modéliser le domaine. Elle favorise la réutilisabilité et la maintenabilité (SOLID), mais nécessite une bonne conception pour éviter l’anti‑pattern ‘God Object’." },
  { "term": "MVC", "definition": "Modèle–Vue–Contrôleur. Architecture séparant les responsabilités : Modèle (données/logiciel métier), Vue (présentation) et Contrôleur (orchestration/flux). Cette séparation facilite les tests, l’évolutivité et la collaboration UI/Back. Exemples : Spring MVC, Laravel, Rails, frameworks front inspirés (Vue/React avec patterns)." },
  { "term": "API", "definition": "Interface de Programmation d’Application. Contrat exposant des fonctionnalités ou des données à d’autres logiciels via des endpoints, des schémas et des règles d’authentification. Une bonne API est documentée (OpenAPI/Swagger), versionnée, testée et respecte les codes d’erreur et quotas pour garantir fiabilité et sécurité." },
  { "term": "CRUD", "definition": "Create, Read, Update, Delete. Quatre opérations fondamentales sur les données, souvent exposées via une API REST et reliées aux verbes HTTP. Elles constituent la base d’une interface d’administration, d’un back‑office ou d’un microservice persistant." },
  { "term": "SQL", "definition": "Structured Query Language. Langage standard pour interroger et manipuler des bases relationnelles (SELECT, JOIN, GROUP BY, transactions). Les bonnes pratiques incluent l’indexation, la normalisation/dénormalisation raisonnée, les vues matérialisées et la prévention des injections via requêtes paramétrées." },
  { "term": "UML", "definition": "Unified Modeling Language. Langage de modélisation visuelle pour analyser et concevoir des systèmes : cas d’usage, diagrammes de classes, de séquence, d’activité, de déploiement. Il facilite la communication entre parties prenantes et sert de support à la documentation vivante." },
  { "term": "IDE", "definition": "Environnement de Développement Intégré (p. ex. VS Code, IntelliJ). Il regroupe éditeur, refactoring, débogueur, intégration Git, exécution de tests et extensions. Un IDE bien configuré améliore la productivité et la qualité (lint, formatage, snippets, inspections)." },
  { "term": "GIT", "definition": "Système de contrôle de version distribué. Permet de suivre l’historique, travailler en branches (feature, release, hotfix), faire des revues (PR/MR) et gérer les conflits/merges. Bonnes pratiques : commits atomiques et message clair, rebase/squash quand pertinent, CI à chaque push." },
  { "term": "JSON", "definition": "JavaScript Object Notation. Format texte léger clé/valeur largement utilisé dans les APIs et configurations. Lisible par humains et machines, il supporte objets, tableaux, booléens, nombres et null. Attention aux pièges : pas de commentaires natifs, gestion des dates/BigInt et encodage UTF‑8." },
  { "term": "HTTP", "definition": "HyperText Transfer Protocol. Protocole du Web pour transporter requêtes/réponses avec méthodes (GET, POST…), statuts (2xx, 4xx, 5xx), en‑têtes (caching, CORS), cookies et sessions. La compréhension de caches, CDN, et des politiques de sécurité (CORS, CSP) est clé pour les performances et la protection." },
  { "term": "CLI", "definition": "Command‑Line Interface. Interface textuelle pour piloter des outils et scripts (Node, Python, Git). Idéale pour l’automatisation et la reproductibilité (Makefile/NPM scripts). Une bonne CLI offre aide intégrée, validation des options et codes de sortie cohérents." },
  { "term": "RGPD", "definition": "Règlement Général sur la Protection des Données (UE). Fixe les obligations sur la collecte, le traitement et la conservation des données personnelles (base légale, consentement, droits des personnes, DPIA). Implique privacy by design, minimisation des données et sécurité adaptée au risque." },
  { "term": "CI/CD", "definition": "Intégration Continue / Déploiement Continu. Ensemble de pratiques et d’outils pour automatiser build, tests, qualité (lint, SAST), packaging et déploiement. Objectif : livraisons fréquentes et fiables, feedback rapide et rollback contrôlé via versioning et feature flags." },
  { "term": "SSL/TLS", "definition": "Protocoles cryptographiques assurant confidentialité et intégrité des échanges réseau. Utilisés par HTTPS, ils reposent sur des certificats X.509 et des suites de chiffrement modernes. Bonnes pratiques : forcer TLS 1.2+, HSTS, renouvellement/rotation des certificats et gestion des secrets." },
  { "term": "PHP", "definition": "Langage de script côté serveur largement utilisé pour le Web (WordPress, Laravel). Exécute du code sur le serveur pour générer du HTML/JSON. Bonnes pratiques : versions supportées, Composer, typage (>=8), frameworks, tests, sécurité (filtrage, CSRF, XSS)." },
  { "term": "MERISE", "definition": "Méthode d’analyse et de conception des systèmes d’information. Sépare les niveaux conceptuel, logique et physique avec MCD/MLD/MPD et processus (MCT/MOT). Sert à modéliser données et traitements avant l’implémentation." },
  { "term": "injection XSS", "definition": "Vulnérabilité permettant d’injecter du JavaScript dans une page vue par d’autres utilisateurs. Prévention : échapper la sortie selon le contexte, CSP, validation serveur/client, assainissement (sanitize) du HTML, utiliser des frameworks qui échappent par défaut." },
  { "term": "injection SQL", "definition": "Attaque consistant à insérer du SQL malveillant via des entrées utilisateur. Prévention : requêtes préparées/paramétrées, ORM, validation en liste blanche, moindre privilège sur la base, séparation des rôles, WAF et journalisation." },
  { "term": "FTP", "definition": "File Transfer Protocol. Protocole de transfert de fichiers. Préférer SFTP/FTPS pour la sécurité. Utilisé pour déployer ou échanger des fichiers ; attention aux droits, modes passif/actif et à l’automatisation par scripts." },
  { "term": "docker", "definition": "Plateforme de conteneurisation. Emballe application et dépendances dans des images exécutées en conteneurs. Avantages : portabilité, isolation, CI/CD. Bonnes pratiques : images minces, multi‑stage builds, gestion des secrets, healthchecks, orchestration (Docker Compose/Kubernetes)." }
]